import React from "react";

class confidentiality extends React.Component {

    render() {
        return (
            <div>
                <div className="faq-security-block">
                    <div className="container">
                        <h1 className="h2Header">Соглашение о конфиденциальности</h1>

                        <p>
                            Благотворительная организация «ПУЛЬС ЖИЗНИ» владелец сайта <a href="/"
                                                                                          className="link-global">http://lifespulse.com</a> c
                            доменным именем <a href="/" className="link-global">http://lifespulse.com</a> далее
                            именуемое «Компания» и Третье лицо, далее
                            именуемое «Пользователь» заключили настоящее Соглашение о конфиденциальности («Соглашение»)
                            для определения порядка получения, хранения, обработки, использования и раскрытия Компанией
                            персональных и других данных Пользователя при использовании им интернет-сайта
                            <a href="/" className="link-global"> http://lifespulse.com</a> (далее «Платформа»).
                        </p>

                        <p>
                            Для того чтобы пользоваться Платформой, Пользователь обязан акцептовать настоящее
                            Соглашение. Если Пользователь не согласен с условиями Соглашения, он не имеет права
                            использовать Платформу.
                        </p>

                        <p>
                            Пользователь, который не достиг установленного законом возраста, дающего ему право заключать
                            такие Соглашения, не имеет права использовать Платформу.
                        </p>

                        <p>
                            1 . ОСНОВНЫЕ ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
                        </p>

                        <p>
                            <strong>Пользователь</strong> - любое лицо, обратившееся к информационным материалам
                            и сервисам Компании путем посещения Платформы.
                        </p>

                        <p>
                            <strong>Персональные данные</strong> - информация, относящаяся к определенному
                            Пользователю и
                            позволяющая идентифицировать этого пользователя как личность.
                        </p>

                        <p>
                            <strong>Общедоступные данные</strong> - данные (в том числе Персональные данные), к
                            которым
                            физическое лицо - владелец этих данных - предоставил доступ неограниченному кругу
                            лиц
                            (в том числе путем публикации на любом интернет-сайте без ограничения доступа к этим
                            данным) или
                            на которые, согласно данному Соглашению и / или действующего законодательства не
                            распространяется
                            требование соблюдения конфиденциальности.
                        </p>

                        <p>
                            <strong>Учетная запись</strong> - запись, содержащая данные авторизации Пользователя
                            (логин и
                            пароль), необходимые для идентификации пользователя при использовании им Платформы.
                        </p>

                        <p>
                            2. ПРЕДМЕТ ДОГОВОРА
                        </p>

                        <p>
                            2.1. Настоящее Соглашение определяет порядок получения, хранения, обработки,
                            использования и
                            раскрытия персональных и других данных (в т.ч. информационных материалов),
                            предоставляемых и
                            размещаемых Пользователем при использовании Платформы.
                        </p>

                        <p>
                            2.2. Пользователь, принимая условия настоящего Соглашения, в случае размещения на
                            Платформе
                            информации, относящейся в соответствии с Законом Украины «О защите персональных
                            данных» к
                            персональным данным, соглашается на ее обработку Компанией как с использованием
                            средств
                            автоматизации, так и без использования таких средств.
                        </p>

                        <p>
                            2.3. Настоящее Соглашение не регулирует, и Компания не несет ответственности за
                            порядок получения,
                            хранения, обработки, использования и раскрытия персональных данных и информационных
                            материалов
                            пользователя сторонними предприятиями и организациями, которые не находятся во
                            владении или под
                            управлением Компании и физическими лицами, не являющимися работниками Компании, даже
                            если
                            Пользователь получил доступ к сайтам, ПО, товарам или услугам этих лиц с помощью
                            Платформы.
                        </p>

                        <p className="otp_big_title">
                            3. ПОЛУЧЕНИЕ, ОБРАБОТКА И ИСПОЛЬЗОВАНИЕ ИНФОРМАЦИИ
                        </p>

                        <p>
                            3.1. При создании учетной записи Пользователь должен указать Данные авторизации, а
                            также имя,
                            фамилию, адрес электронной почты и другие данные. После создания и использования
                            Пользователем
                            учетной записи, Компания получает возможность идентифицировать Пользователя при
                            каждом
                            использовании им Платформы.
                        </p>

                        <p>
                            3.2. При использовании Пользователем Платформы, ее сервисов и функций, оборудование
                            Компании
                            автоматически сохраняет, обрабатывает и использует данные пользователя, не
                            относящиеся к
                            Персональным, например: IP-адрес пользователя, данные о местонахождении
                            пользователя, которые можно
                            определить с помощью IP-адреса, технические параметры компьютера пользователя,
                            наличие или
                            отсутствие в компьютере пользователя конкретного программного обеспечения, настройки
                            данного
                            программного обеспечения, а также статистическая информация об активности
                            Пользователя.
                        </p>

                        <p>
                            3.3. Компания имеет право хранить Персональные и другие данные пользователя столько,
                            сколько
                            необходимо в целях успешного функционирования Платформы или в сроки, установленные
                            действующим
                            законодательством страны, международным законодательством, или страны Пользователя,
                            или до момента
                            удаления Пользователем этих данных.
                        </p>

                        <p>
                            3.4. В случае изменения персональных данных, Пользователь обязан поставить в
                            известность Компанию,
                            обновив учетную запись. В противном случае, компания не несет ответственности за
                            негативные
                            последствия такой обработки.
                        </p>

                        <p>
                            4. ДОСТУП К ИНФОРМАЦИИ
                        </p>

                        <p>
                            4.1. С целью функционирования Платформы, реализации гражданско-правовых, налоговых,
                            договорных
                            отношений, создания и поддержки персональной страницы Пользователя, функционирования
                            персональных
                            баз данных Компании, отправки предложений и информации с Платформы, Пользователь
                            безусловно соглашается:
                        </p>

                        <p>
                            - С предоставлением своих персональных данных как Компании, так и др. пользователям;
                        </p>

                        <p>
                            - С распространением персональных данных с помощью Платформы относительно других
                            Пользователей;
                        </p>

                        <p>
                            - С другими действиями Компании по таким данным в связи с функционированием
                            Платформы.
                        </p>

                        <p>
                            - При этом, на страницах Платформы Компания имеет право отразить имя, фамилию,
                            отчество, название
                            компании, город проживания / местонахождение, адрес электронной почты Пользователя
                            при отображении:
                            контента, информации об Авторе проекта, спонсорах и внесенных ими вкладов.
                        </p>

                        <p>
                            4.2. Компания обязуется не предоставлять персональные данные третьим лицам в
                            коммерческих целях без
                            согласия Пользователя, к которому относятся эти данные, за исключением случаев,
                            связанных с
                            непосредственным функционированием Платформы и отраженных в п.4.1 настоящего
                            Соглашения. Передача
                            персональных данных третьим лицам допускается в следующих случаях:
                        </p>

                        <p>
                            - После получения согласия пользователя, к которому относится вышеуказанная
                            информация.
                        </p>

                        <p>
                            - При необходимости передачи персональных данных с целью выполнения заказа или
                            запроса Пользователя.
                        </p>

                        <p>
                            - По обоснованным запросам государственных органов, имеющих право получать такие
                            данные.
                        </p>

                        <p>
                            - В том случае, если, по мнению Компании, Пользователь нарушает условия данного
                            Соглашения и / или
                            других договоров и соглашений, заключенных между Сторонами.
                        </p>

                        <p>
                            4.3. Пользователь дает согласие Компании разрешать третьим лицам, с которыми она
                            заключила
                            соответствующие соглашения, получать, хранить и обрабатывать данные о пользователе
                            (кроме
                            персональных данных и информационных материалов), такие как IP-адрес пользователя, а
                            также
                            статистическая информация об активности пользователя для улучшения качества
                            предоставляемых этими
                            лицами услуг и информацию рекламного характера.
                        </p>

                        <p>
                            4.4. Пользователь соглашается с тем, что конфиденциальность переданных через
                            Интернет данных не
                            гарантирована и в случае, если доступ к этим данным получен третьими лицами вне зоны
                            технических
                            средств связи, подвластных Компании, Компания не несет ответственности за ущерб,
                            нанесенный таким
                            доступом.
                        </p>

                        <p>
                            4.5. Пользователь имеет право запросить, изменить или удалить свои персональные
                            данные, которые
                            находятся в Компании, пользователь может самостоятельно изменить или удалить свои
                            персональные
                            данные, используя соответствующие функции Платформы и свою учетную запись. В случае
                            если это не
                            представляется возможным, Пользователю необходимо заявить соответствующее
                            требование, направив его
                            на электронный адрес Компании, указанный на Платформе.
                        </p>

                        <p>
                            4.6. В случае предоставления Пользователем данных своих контрагентов - физических
                            лиц,
                            принадлежащих в соответствии с законодательством Украины к персональным данным,
                            Пользователь
                            подтверждает свое право и согласие своих контрагентов - физических лиц (а в случае
                            отсутствия
                            обязуется обеспечить получение такого согласия) на обработку и хранение таких
                            персональных данных,
                            а также их передачу третьим лицам в порядке и на условиях, предусмотренном
                            действующим
                            законодательством Украины.
                        </p>

                        <p>
                            4.7. Доступ к учетной записи (аккаунту) и информационным материалам, хранящимся в
                            личном кабинете
                            пользователя, осуществляется с использованием соответствующего логина и пароля. В
                            случае если
                            сервисы Платформы, доступные Пользователю, позволяют сделать общедоступной
                            какую-либо информацию
                            пользователя, Пользователь самостоятельно и под свою собственную ответственность
                            активирует и
                            использует данные функции Платформы и сервисов.
                        </p>

                        <p>
                            При этом Пользователь понимает и соглашается с тем, что, размещая на платформе
                            информацию, в
                            отношении которой им самостоятельно не установлены ограничения доступа, любое третье
                            лицо может
                            получить доступ к этой информации.
                        </p>

                        <p>
                            5. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ
                        </p>

                        <p>
                            5.1. Компания имеет право вносить изменения в настоящее Соглашение. Все внесенные в
                            Соглашение
                            изменения будут доступны в виде новой редакции Соглашения по адресу
                            http://na-starte.com.
                            Информация об изменении этого Соглашения будет размещена на соответствующей странице
                            Платформы.
                            В случае внесения в Соглашение изменений, пользователю необходимо будет ознакомиться
                            с ними, чтобы
                            быть проинформированным о том, как Компания защищает информацию о Пользователях.
                        </p>

                        <p>
                            5.2. Все изменения в Соглашении вступают в силу с момента их публикации на
                            Платформе. Используя
                            Платформу, Пользователь тем самым подтверждает свое согласие с новыми условиями
                            Соглашения в
                            редакции, действующей на момент использования Пользователем Платформы.
                        </p>

                        <p>
                            5.3. Компания не несет ответственности за ущерб или убытки, понесенные Пользователем
                            или третьими
                            лицами в результате ошибочного понимания или непонимания условий данного Соглашения,
                            инструкций или
                            указаний о порядке использования Сайта, относительно порядка размещения
                            информационных данных и
                            других технических вопросов.
                        </p>

                        <p>
                            5.4. В случае признания недействительной или неосуществимой любой части настоящего
                            Соглашения,
                            другие части Соглашения будут оставаться в силе. Отказ каждой из Сторон от любого
                            положения или
                            условия настоящего Соглашения или любое их нарушение не отменяет действие этого
                            положения или
                            условия.
                        </p>

                        <p>
                            5.5. К настоящему Соглашению и отношениям между Компанией и Пользователем
                            применяется
                            законодательство Украины. Каждая сторона полностью соглашается с тем, что
                            соответствующие суды
                            Украины имеют исключительную юрисдикцию в отношении любых претензий и споров,
                            которые возникли.
                        </p>
                    </div>
                </div>

            </div>

        )
    }
};

export default confidentiality;