import React from "react";

class Rules extends React.Component {

    render() {
        return (
            <div>
                <div className="rules-block">
                    <div className="container">
                        <article>
                            <h1 className="h2Header">Правила платформы</h1>

                            <p>
                                Наш мир находится в постоянном развитии. Этот непрерывный процесс постоянно требует
                                свежих идей.
                                Сейчас крайне необходимо развитие искусства, культуры, технологий. С этой необходимостью
                                и родилась
                                краудфандинговая платформа Na-Starte! Здесь каждый человек может рассказать о своей
                                идее, собрать
                                команду единомышленников и даже самая смелая мечта может стать реальностью.
                            </p>

                            <p>
                                Наша цель - воплощение креативных идей в жизнь. Мы раскрываем творческий потенциал, даем
                                возможность рассказать миру о себе и о своих мечтах, вместе ищем заинтересованных
                                спонсоров. Это
                                невероятно сложная работа для одного человека, но легко реализуемая для целой команды
                                активных
                                людей.
                            </p>

                            <p>
                                Команда <a href="/">Na-Starte</a> — это именно такие активные, молодые и креативные
                                люди, которые
                                стремятся собрать вокруг платформы сообщество интересных личностей. Мы ищем перспективу
                                в каждом
                                проекте и показываем его лучшие стороны. Вместе мы сможем всё!
                            </p>

                            <p>
                                А для того, чтобы все вышесказанное не оказалось пустыми словами, предлагаем
                                ознакомиться с этими
                                Правилами, которые подтвердят серьезность намеченных нами целей.
                            </p>

                            <p className="otp_big_title">
                                ПРАВИЛА ПЛАТФОРМЫ (АГЕНТСКОЕ СОГЛАШЕНИЕ)
                            </p>

                            <p>
                                ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «ІНТЕРАКТИВНА МЕДІА ПЛАТФОРМА», іменоване
                                «Компанія» і
                                Третя особа, далі іменована «Учасник проекту», яка висловила у встановленій Компанією
                                письмовій
                                формі свою згоду на укладання публічної Агентської угоди і акцептувала цю оферту,
                                розміщену у мережі
                                Інтернет за адресою http://na-starte.com, уклали дану Агентську угоду, далі іменовану
                                «Угода» про
                                наступне:
                            </p>

                            <p className="otp_big_title">
                                1. ОСНОВНІ ТЕРМІНИ І ВИЗНАЧЕННЯ
                            </p>

                            <p>
                                <strong>Компанія</strong> - ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «ІНТЕРАКТИВНА МЕДІА
                                ПЛАТФОРМА»
                                (код ЕДРПОУ 38949688).
                            </p>

                            <p>
                                <strong>Користувач</strong> – будь-яка особа, яка звернулася до інформаційних матеріалів
                                і сервісів
                                Компанії шляхом відвідування Сайту http://na-starte.com, далі «Платформа», «Сайт».
                            </p>

                            <p>
                                <strong>Проект</strong> – публікація літературного твору, запис диска, зйомка фільму,
                                пошиття одягу,
                                створення фотографій, організація художньої виставки, розробка гри або технології, показ
                                театральної постановки, організація концерту і інші творчі, у тому числі і соціальні,
                                пропоновані
                                до реалізації проекти, інформація про які розміщується на Платформі.
                            </p>

                            <p>
                                <strong>Учасник проекту</strong> – фізична або юридична особа (ФОП, ТОВ, Громадські
                                організації,
                                Благодійні фонди та ін.), яка має обліковий запис (реєстрацію) на Платформі, яка
                                прийняла умови
                                цієї Угоди та Правила Платформи і виявила намір представити на Платформі свій авторський
                                Проект
                                або перерахувати на підтримку того чи іншого Проекту грошові кошти.
                            </p>

                            <p>
                                <strong>Автор проекту</strong> – Учасник проекту, який створив Проект, та надає про
                                нього інформацію
                                Компанії для подальшого розгляду, реєстрації та публікації на Платформі з метою
                                анонсування, збору
                                необхідних грошових коштів та подальшої реалізації.
                            </p>

                            <p>
                                <strong>Спонсор</strong> – Учасник проекту, який здійснює Внесок на користь обраного ним
                                Проекту
                                та який вирішив таким чином отримати Винагороду, запропоновану Автором проекту.
                            </p>

                            <p>
                                <strong>Вклад</strong> – грошова сума, яка вноситься Спонсором на банківський рахунок
                                Компанії з
                                метою подальшого перерахування на користь Проекту та отримання запропонованої Автором
                                проекту
                                Винагороди.
                            </p>

                            <p>
                                <strong>Винагорода</strong> – нагорода матеріального чи морального характеру, що є
                                результатом
                                реалізації Проекту, пропонована Автором проекту Спонсорам за внесення Вкладу.
                            </p>

                            <p>
                                <strong>Заявка</strong> – створений Автором Проект, що не пройшов модерацію.
                            </p>

                            <p>
                                <strong>Рахунок Компанії</strong> – поточний рахунок Компанії у фінансовій установі
                                (банку).
                            </p>

                            <p>
                                Всі інші терміни та визначення, не зазначені у пункті 1 цієї Угоди, повинні визначатися
                                відповідно
                                до тлумачення, сформованим у практиці ділового обороту, та чинним законодавством
                                України.
                            </p>

                            <p className="otp_big_title">
                                2. ЗАГАЛЬНІ ПОЛОЖЕННЯ
                            </p>

                            <p>
                                2.1. Ця Угода є публічною пропозицією (офертою) Компанії для невизначеного кола осіб у
                                розумінні
                                ст.ст. 633, 641, 644 Цивільного кодексу України.
                            </p>

                            <p>
                                2.2. Ця Угода діє одночасно з Правилами Платформи та Угодою про конфіденційність,
                                розміщеними у
                                мережі Інтернет за адресою http://na-starte.com. Зазначені документи доповнюють один
                                одного і
                                обов'язкові до дотримання всіма особами, які використовують властивості Платформи.
                            </p>

                            <p>
                                2.3. Невід'ємною частиною цієї Угоди є Додаткова угода між Автором проекту і Компанією,
                                яка
                                підписується перед публікацією Проекту та встановлює права і обов'язки сторін щодо
                                конкретного
                                Проекту, далі - «Додаткова угода».
                            </p>

                            <p>
                                2.4. Платформа використовується:
                                – Автором проекту для представлення Користувачам власної авторської ідеї через
                                публікацію
                                інформації про Проект з метою збору необхідних грошових коштів та подальшої його
                                реалізації;
                                – Спонсором для підтримки того чи іншого Проекту шляхом надання грошових коштів
                                та
                                отримання Винагороди, пропонованої Автором проекту.
                            </p>

                            <p>
                                2.5. Відповідно до умов цієї Угоди, Компанія виступає у ролі:
                            </p>

                            <p>
                                2.5.1. суб'єкта, який надає Користувачам технічні та інші можливості Платформи як
                                інтернет-майданчика для інформаційного, організаційного і правового спілкування, у тому
                                числі для
                                отримання інформації про проекти і надання винагороди; для підтримки того чи іншого
                                Проекту шляхом
                                здійснення Вкладу на його користь у порядку і на умовах, передбачених відповідним
                                Автором проекту
                                і цією Угодою;
                            </p>

                            <p>
                                2.5.2. агента, що діє від імені Автора проекту, а саме: Компанія надає послуги Автору
                                проекту з
                                надання наборів сервісів для розміщення його власного Проекту на Платформі, а також
                                надає допомогу
                                у зборі коштів шляхом прийняття Вкладів від Спонсорів на користь Автора Проекту з
                                подальшим
                                перерахуванням йому грошових коштів у разі їх повного збору.
                            </p>

                            <p>
                                2.6. Компанія, за письмовою домовленістю з Учасником, може надавати додаткові
                                консультаційні/маркетингові/рекламні послуги та посприяти:
                            </p>

                            <ul>
                                <li>у проведенні експертизи Проекту на унікальність;</li>
                                <li>у створенні плану та оформленні Проекту;</li>
                                <li>у складанні бізнес-плану;</li>
                                <li>в організації просування та реалізації Проекту;</li>
                                <li>інше.</li>
                            </ul>

                            <p>
                                Вищевказані послуги надаються Учаснику на умовах індивідуального замовлення ПАКЕТІВ
                                ПОСЛУГ
                                Компанії.
                            </p>

                            <p>
                                2.7. Розміщення Компанією інформації по Проектах, отриманої або ймовірної винагороди від
                                Автора
                                проекту; отримання комісії за використання технічних та інших можливостей Платформи не є
                                приводом
                                або підставою для визнання Компанії стороною за угодами, що укладаються між Автором
                                проекту і
                                Спонсором.
                            </p>

                            <p>
                                2.8. Всі зобов'язання щодо того чи іншого Проекту виникають безпосередньо між Авторами
                                проектів і
                                Спонсорами. Компанія не є організатором Заявок, не гарантує вихід того чи іншого
                                Проекту.
                                Платформа http://na-starte.com є інтернет-майданчиком для розміщення відповідних
                                Проектів.
                                Відповідальність за дійсність та можливість втілення зобов'язань по Проекту несе Автор
                                проекту
                                одноосібно.
                            </p>

                            <p>
                                2.9. Учасниками проекту можуть бути фізичні особи, які досягли встановленого законом
                                віку,
                                який передбачає можливість участі в подібних Угодах і володіють необхідною дієздатністю,
                                а також
                                юридичні особи різних організаційно-правових форм.
                            </p>

                            <p>
                                2.10. Якщо країна проживання/місцезнаходження особи встановлює обмеження в участі у
                                подібних
                                Проектах, особа повинна утриматися від акцепту Угоди.
                            </p>

                            <p>
                                2.11. Перед приєднанням до Проекту Учасник проекту зобов'язаний уважно ознайомитися з
                                умовами цієї
                                Угоди. Участь у Проекті дозволяється лише особам, які повністю прийняли умови цієї
                                Угоди,
                                розміщеної на Платформі http://na-starte.com.
                            </p>

                            <p>
                                Приєднання до даної публічної пропозиції здійснюється в цілому.


                                Учасник проекту не може запропонувати Компанії свої умови.
                            </p>

                            <p>
                                2.12. Висловивши свою згоду на прийняття умов Угоди дистанційним шляхом, проставивши на
                                Платформі в
                                установленому місці відповідні відмітки і направивши Проект на розгляд Компанії в якості
                                Автора
                                проекту або здійснивши Вклад в якості Спонсора, Учасник проекту тим самим підтверджує
                                своє повне
                                розуміння і згоду з умовами цієї Угоди. Якщо особа незгодна з умовами Угоди, їй не
                                надається статус
                                і права Учасника проекту.
                            </p>

                            <p>
                                2.13. Після завершення збору коштів Проект залишається доступним на Платформі Компанії.
                            </p>

                            <p className="otp_big_title">
                                3. УМОВИ РЕЄСТРАЦІЇ ПРОЕКТУ
                            </p>

                            <p>
                                3.1. Автор проекту гарантує, що Проект є результатом його особистої творчої праці.
                                Інформація по
                                Проекту, яку він надає Компанії, є законною, повною і достовірною, що не порушує
                                авторські та
                                суміжні права третіх осіб.


                                Якщо Проект створений у співавторстві або містить в собі елементи творів, що
                                охороняються
                                авторським і суміжними правами і належать третім особам, Автор проекту гарантує, що
                                ним отримано
                                дозвіл від відповідних правовласників, що дає йому право акцептувати цю Угоду.
                            </p>

                            <p>
                                3.2. До реєстрації та публікації на Платформі допускаються Проекти, які не порушують цю
                                Угоду,
                                Правила Платформи та чинного законодавства України.


                                Платформа не призначена для бізнес-проектів, проектів, які носять характер
                                особистого фінансування
                                - навчання, лікування, придбання чого-небудь та ін.; проектів, що передбачають в
                                якості винагороди
                                предмети, які не є результатом реалізації Проекту; алкоголь, тютюн, наркотики,
                                зброя; електронне
                                обладнання для стеження; медикаменти, харчові добавки і предмети особистої гігієни;
                                енергетичні
                                напої і їжа; лотереї і тоталізатори, багаторівневий маркетинг і «піраміди»;
                                порнографія; інші
                                напрямки та проекти, що порушують законодавство України та суперечать внутрішнім
                                переконанням
                                адміністрації Компанії.
                            </p>

                            <p>
                                3.3. Робота Платформи організована за категоріями: музика, кіно, література і т.д.
                                Конкретну
                                категорію вибирає Автор проекту. Компанія має право перенести Проект в іншу категорію,
                                попередньо
                                повідомивши Автора проекту.
                            </p>

                            <p>
                                3.4. Для розміщення Заявки Автор проекту представляє наступні дані:
                            </p>

                            <p>
                                3.4.1. обкладинка Заявки;
                            </p>

                            <p>
                                3.4.2. назва Заявки;
                            </p>

                            <p>
                                3.4.3. категорія Заявки;
                            </p>

                            <p>
                                3.4.4. короткий опис Заявки;
                            </p>

                            <p>
                                3.4.5. місце реалізації Заявки;
                            </p>

                            <p>
                                3.4.6. термін збору коштів Заявки;
                            </p>

                            <p>
                                3.4.7. необхідну суму для реалізації Заявки;
                            </p>

                            <p>
                                3.5.6. Винагороди для користувачів, вартість Винагород, термін та умови їх доставки;
                            </p>

                            <p>
                                3.5.7. відеопрезентацію Заявки;
                            </p>

                            <p>
                                3.5.8. повний опис Заявки;
                            </p>

                            <p>
                                3.5.9. реквізити для перерахування коштів;
                            </p>

                            <p>
                                3.5.10. E-mail Автора проекту;
                            </p>

                            <p>
                                3.5.11. мобільний телефон Автора проекту;
                            </p>

                            <p>
                                3.5.12. за кожен Внесок від Автора проекту призначається Винагорода (нагорода), що є
                                результатом
                                реалізації Проекту. При цьому Автор проекту зобов'язаний надати докладний опис такої
                                Винагороди,
                                а також умов і термінів її отримання. Усі витрати, пов'язані з такими нагородами, несе
                                Автор
                                проекту самостійно. Компанія не бере участі в їх відшкодуванні.


                                Разом з тим, Автор проекту може встановити Винагороду морального характеру
                                (наприклад, подяка
                                Спонсорові, виражена на Платформі особисто Автором проекту).


                                У цьому випадку вважається, що Вклад вноситься у формі пожертвування і має на
                                меті безоплатно
                                підтримати Проект.
                            </p>

                            <p>
                                3.5. Компанія залишає за собою право запросити у Автора проекту додаткову інформацію та
                                матеріали
                                (в тому числі копії необхідних документів), що стосуються умов реалізації Проекту.


                                Автор проекту зобов'язаний надати таку інформацію протягом 5 (п'яти) календарних
                                днів з дня
                                направлення Компанією відповідного запиту Автору проекту.
                            </p>

                            <p>
                                3.6. Остаточне рішення про реєстрацію та публікацію проекту на Платформі належить
                                Компанії.
                                Компанія залишає за собою право відмовити Автору проекту в розміщенні Проекту на
                                Платформі або
                                відкликати (видалити) вже зареєстрований і опублікований Проект в разі, якщо Автор
                                проекту порушує
                                умови цієї Угоди або з'ясується, що Автор проекту порушив права третіх осіб.
                            </p>

                            <p>
                                3.7. У разі відмови в публікації/реєстрації Проекту або розміщенні інших матеріалів,
                                інформації,
                                Компанія не несе ніякої відповідальності, в тому числі не відшкодовує прямих або
                                непрямих збитків,
                                що виникли у Автора проекту або інших користувачів у зв'язку з такою відмовою.
                            </p>

                            <p className="otp_big_title">
                                4. ФІНАНСОВІ УМОВИ ПРОГРАМИ
                            </p>

                            <p>
                                4.1. Автор проекту самостійно визначає систему фінансування та обсяг фінансування, який
                                необхідний
                                для реалізації свого Проекту.
                            </p>

                            <p>
                                4.2. Системи фінансування Проекту:

                                a) <strong>«Усе або нічого»</strong> - Автор самостійно встановлює термін, протягом
                                якого
                                збирається заявлений ним обсяг фінансування Проекту. У тому випадку, якщо Проект
                                зібрав 100% і
                                більше суми за заявлений час – грошові кошти перераховуються Автору. В іншому
                                випадку зібрані
                                грошові кошти повертаються на рахунки Спонсорів всередині Платформи (на їх особистий
                                баланс).
                                b) <strong>«Гнучка система фінансування»</strong> - Автор заявляє певний обсяг
                                фінансування
                                Проекту протягом певного періоду часу (який може бути продовжений). У тому
                                випадку, якщо за
                                вказаний період Проект зібрав більше 50 % від заявленого обсягу фінансування,
                                грошові кошти
                                перераховуються Автору.


                                Також, з виплачуваних грошових коштів повинні бути сплачені податки у
                                порядку та в розмірах,
                                встановлених чинним законодавством України.
                            </p>

                            <p>
                                4.3. Після реєстрації та публікації Проекту на Платформі зміна заявленого обсягу
                                фінансування
                                заборонена. При розрахунку суми, необхідної на реалізацію Проекту, Автор проекту
                                зобов'язаний
                                врахувати розмір комісії, яку він виплатить Компанії за використання Платформи, комісію
                                платіжної
                                системи/банківської комісії за перерахування грошових коштів, а також податок, який
                                зобов'язана
                                утримати Компанія з виплачуваних грошових коштів як податковий агент, у випадках,
                                передбачених
                                законодавством.
                            </p>

                            <p>
                                4.4. Термін збору грошових коштів встановлює сам Автор проекту залежно від складності
                                Проекту.
                                Компанія залишає за собою право рекомендувати Автору проекту встановлення того чи іншого
                                терміну
                                для реалізації Проекту
                            </p>

                            <p>
                                4.5. Всі Вклади, одержані за допомогою Платформи від Спонсорів для підтримки Проекту та
                                призначені
                                перерахуванню Авторам проекту, акумулюються на рахунку Компанії.


                                Спонсор може внести Вклад будь-яким зручним йому способом із запропонованих
                                Компанією в його
                                особистому кабінеті на Платформі.


                                Інформація про кошти, що надійшли на підтримку того чи іншого Проекту, щодня
                                відображається на
                                Платформі, а саме: загальна кількість грошових коштів, що надійшли на підтримку
                                проекту, інформація
                                про Користувачів, які взяли участь у фінансуванні Проекту.
                            </p>

                            <p>
                                4.6. Автор проекту отримує зібрані Компанією Вклади тільки в разі, якщо Проект зібрав за
                                допомогою
                                Платформи повну суму грошових коштів у встановлений для цього Проекту термін (за
                                винятком проектів
                                з гнучкими умовами фінансування). Грошові кошти перераховуються на рахунок Автора
                                проекту через
                                10-14 днів після завершення збору коштів.
                            </p>

                            <p>
                                4.7. Розмір комісії за використання Платформи щодо конкретного Проекту узгоджується
                                сторонами до
                                початку його публікації та зазначається у Додатковій угоді до цієї Агентської угоди. При
                                перерахуванні коштів на користь Автора проекту Компанія самостійно утримує з цієї суми
                                комісію за
                                використання Платформи.
                            </p>

                            <p>
                                4.8. Якщо Проект зібрав 50 (п'ятдесят) і більше відсотків грошових коштів, Автор проекту
                                має право
                                сам його дофінансувати. Дофінансування відбувається шляхом внесення грошових коштів
                                Автором проекту
                                на рахунок Компанії з наступним їх відображенням на Платформі. При цьому, грошові кошти,
                                внесені
                                Автором проекту, включаються в загальну суму грошових коштів, з якої Компанією
                                утримується комісія
                                за використання Платформи.
                            </p>

                            <p>
                                4.9. При здійсненні виплат Автору проекту Компанія має право утримати із суми виплати
                                всі необхідні
                                податки, які Компанія зобов'язана сплатити як податковий агент (наприклад, податок з
                                доходів
                                фізичних осіб, якщо грошові кошти отримує фізична особа тощо). Якщо згідно із
                                законодавством
                                України обов'язок безпосередньої сплати податків при отриманні грошових коштів Автором
                                проекту
                                покладається на цього Автора, він зобов'язується своєчасно і в повному розмірі сплатити
                                всі
                                необхідні податки відповідно до отриманої ним суми грошових коштів.
                            </p>

                            <p>
                                4.10. У разі якщо Проект зібрав менше заявленого Автором обсягу фінансування, всі кошт
                                и повертаються Спонсорам на їх особистий баланс.


                                При цьому інформація про Проект залишається доступною на Платформі і не підлягає
                                видаленню.
                            </p>

                            <p>
                                4.11. Якщо зібрані кошти перевищують заявлений Автором проекту обсяг фінансування, то
                                останній має
                                право достроково припинити збір коштів через заявку, подану Компанії допомогою
                                електронної пошти,
                                або перевищити його розмір.
                            </p>

                            <p>
                                4.12. У разі односторонньої відмови Спонсора від участі в Проекті протягом дії терміну
                                збору
                                грошових коштів, Спонсор може повернути Вклад, внесений ним на користь Проекту, шляхом
                                натискання
                                кнопки «скасувати участь» на сторінці вибору винагороди Проекту, в якому він бере
                                участь.
                            </p>

                            <p>
                                4.13. Повернення Спонсору внесених ним грошових коштів здійснюється на його
                                поточний/картковий
                                рахунок з якого здійснювалась спонсорська підтримка Проекту.


                                Якщо Спонсор має намір повернути внесені ним грошові кошти на свій
                                поточний/картковий рахунок
                                (повністю вивести з Платформи), він повинен заповнити заяву про повернення грошових
                                коштів, згідно
                                наведеного зразка, і надіслати підписану сканкопію заяви, з прикріпленою до неї
                                копією свого
                                паспорта та ідентифікаційного коду, на електронну адресу Компанії.


                                У разі втрати, блокування карти, з якої відбувалося перерахування, зміни
                                поточного рахунку, Спонсор
                                додатково надсилає поштою на адресу Компанії, оригінал довідки банку про те, що
                                карта/рахунок
                                належали даному Спонсорові, а також заяву з проханням вивести грошові кошти на
                                іншу картку, в
                                зв'язку з тим, що попередня карта/поточний рахунок заблоковані, карта загублена,
                                її перевипущено
                                і т.д. У разі заведення грошових коштів на Платформу шляхом перерахування через
                                касу банку,
                                Спонсор повинен переслати на електронну адресу Компанії сканкопію квитанції.


                                Після чого, Компанія протягом 14 календарних днів повертає Спонсорові, за
                                вказаними ним реквізитами,
                                суму грошових коштів, у розмірі зазначеному в заяві (але не більше ніж сума,
                                що знаходиться на його
                                особистому балансі в профілі на Платформі), за вирахуванням банківської
                                комісії/комісії платіжної
                                системи, стягнутої за перерахування грошей на рахунок компанії і в сторону
                                Спонсора. При цьому,
                                гроші можуть бути перераховані (повернуті) виключно на платіжні карти і
                                поточні рахунки в гривні
                                і тільки на особистий рахунок самого Спонсора.
                            </p>

                            <p>
                                4.14. Відмова Спонсора від участі в Проекті після закінчення збору коштів не
                                допускається.
                            </p>

                            <p>
                                4.15. У разі односторонньої відмови Автора проекту від подальшої реалізації Проекту
                                після
                                завершення повного збору коштів і публікації на Платформі відповідної інформації Автор
                                проекту
                                повинен сповістити про це Компанію за допомогою електронної пошти, інформація про яку
                                розміщена на
                                Платформі. В цьому випадку Компанія повертає Спонсорам Вклади за винятком банківської
                                комісії/комісії платіжної системи, яка справляється за перерахування грошей на рахунок
                                компанії і в
                                сторону Спонсора.
                            </p>

                            <p>
                                4.16. При поверненні коштів Спонсорові або перерахуванні Автору проекту можливі комісії
                                при
                                конвертації валюти, які утримуються з перерахованих йому грошових коштів.
                            </p>

                            <p>
                                4.17. Спонсор має можливість отримати повернені грошові кошти на особистий баланс (без
                                їх повного
                                виведення з Платформи), в тому випадку, якщо:

                                - Проект став неуспішним та не зібрав повну суму заявленого обсягу його
                                фінансування.
                                - Проект по збиранню коштів зупинений/призупинений або повністю припинений та
                                видалений з
                                розділу «Проекти».
                                - якщо Спонсор відізвав свою спонсорську участь у Проекті.
                            </p>

                            <p>
                                4.18. У тому випадку, якщо Внесок в Проект був повернений на особистий рахунок Спонсора
                                (в
                                особистий кабінет) і Спонсор не проводив з цими грошовими коштами ніяких операцій
                                протягом 3
                                місяців (не проспонсував інший проект і не запросив виведення грошових коштів), то
                                Компанія має
                                право розподілити ці кошти в інші Проекти на Платформі на свій розсуд.
                            </p>

                            <p>
                                4.19. Компанія, за згодою Автора, залишає за собою право відображати кошти, залучені
                                Автором в
                                Проект за допомогою маркетингово-рекламних, а також PR компаній, які не пройшли через
                                рахунок
                                Платформи, а були пожертвувані / проспонсовані / проінвестовані Автору у якості
                                фінансування
                                Проекту. Комісія з цих коштів не стягується. Автор зобов'язується самостійно виплатити
                                податок з
                                отриманих таким чином грошових коштів.
                            </p>

                            <p className="otp_big_title">
                                5. ПРАВИЛА ДЛЯ УЧАСНИКІВ ПРОЕКТУ
                            </p>

                            <p>
                                5.1. Учасник проекту має право:

                                – в якості Автора проекту подати на розгляд Компанії Проект з метою його подальшої
                                реєстрації
                                та публікації на Платформі і отримати грошові кошти в разі 100% їх збору;
                                дофінансувати Проект,
                                якщо він зібрав 50 (п'ятдесят) і більше відсотків грошових коштів; достроково
                                припинити збір коштів
                                або перевищити встановлений обсяг фінансування, якщо зібрана сума грошових коштів
                                перевищила
                                заявлений розмір.
                                – користуватися всіма можливостями Платформи, наданими Компанією;
                                – в якості Спонсора внести Вклад на користь будь-якого обраного Проекту та
                                отримати від
                                Автора проекту відповідну Винагороду, а також отримати повернення грошових
                                коштів за винятком
                                банківської комісії / комісії платіжної системи у випадках, передбачених п.4
                                цієї Угоди.
                            </p>

                            <p>
                                5.2 . Учасник зобов'язується:

                                – використовувати Платформу відповідно до умов цієї Угоди, Правил Платформи та
                                положень
                                чинного законодавства України;
                                – надавати Компанії та іншим Користувачам достовірну інформацію щодо своєї
                                особи, в тому
                                числі і рахунку, наданого для перерахування грошових коштів;
                                – здійснювати збір, розміщувати і обробляти будь-яку особисту інформацію, що
                                стосується інших
                                користувачів і третіх осіб виключно за наявності їх згоди;
                                – не порушувати права, свободи інших користувачів Платформи, авторів і
                                інших третіх осіб, в
                                тому числі права інтелектуальної власності;
                                – не публікувати на Платформі платіжні реквізити, завдяки яким
                                перерахування Вкладів може
                                бути здійснено не в установленому Компанією порядку та/або не на
                                поточний рахунок Компанії, а також
                                не використовувати для перерахування Вкладів інші засоби оплати,
                                крім встановлених на Платформі.
                                Компанія не несе відповідальності і не гарантує отримання Автором
                                проекту таких Вкладів, а також їх
                                повернення Спонсорам;
                                – не розміщувати Проект на інших платформах, сайтах, порталах
                                тощо, в Україні, але може
                                рекламувати його на інших мережевих ресурсах.
                            </p>

                            <p className="otp_big_title">
                                6. ВІДПОВІДАЛЬНІСТЬ
                            </p>

                            <p>
                                6.1. Компанія здійснює редагування (модерацію) інформації в Заявці, розміщеної Автором
                                проекту на
                                Платформі в частині орфографічних і стилістичних змін. Компанія не має можливості
                                здійснювати
                                перевірку наданої Автором проекту інформації, в тому числі перевірити дотримання Автором
                                проекту
                                чинного законодавства про інтелектуальну власність, відповідно, не може гарантувати її
                                якість,
                                достовірність та правомірність. У зв'язку з вищевказаним, Компанія не несе перед
                                Користувачами,
                                Учасниками проекту та третіми особами відповідальності за будь-яку помилкову,
                                неправомірну та/або
                                недостовірну інформацію, зазначену на Платформі.
                            </p>

                            <p>
                                6.2. Компанія не відповідає перед Учасниками проекту або третіми особами по будь-яких
                                зобов'язаннях
                                Автора проекту, в тому числі про можливість отримання Спонсорами якої-небудь Винагороди
                                за внесення
                                Вкладів або вчинення Учасниками будь-яких інших дій.
                            </p>

                            <p>
                                6.3. Компанія не відшкодовує збитки, завдані Учаснику проекту або третім особам в
                                результаті участі
                                кого-небудь в Проекті.
                            </p>

                            <p>
                                6.4. Компанія не гарантує відповідність Платформи та Проектів цілям і очікуванням
                                Учасника проекту.
                                Компанія не несе відповідальності за шкоду або збитки, понесені Учасником проекту або
                                третіми
                                особами в результаті помилкового розуміння або нерозуміння умов Проекту, інструкцій або
                                вказівок.
                            </p>

                            <p>
                                6.5. Компанія не несе відповідальності перед Спонсорами та третіми особами за
                                невиконання та/або
                                неналежне виконання Автором проекту своїх зобов'язань в разі скасування Заявки.
                            </p>

                            <p>
                                6.6. Учасники проекту - як Автор проекту, так і Спонсор - самостійно несуть
                                відповідальність перед
                                третіми особами за свої дії або бездіяльність при участі в Проекті.
                            </p>

                            <p className="otp_big_title">
                                7. КОНФІДЕНЦІЙНІСТЬ
                            </p>

                            <p>
                                7.1. Учасники проекту, приймаючи умови цієї Угоди, у разі розміщення на Платформі
                                інформації, що
                                відноситься відповідно до Закону України «Про захист персональних даних» до персональних
                                даних,
                                погоджуються на їх обробку як з використанням засобів автоматизації, так і без
                                використання засобів
                                автоматизації Компанією в цілях виконання зобов'язань перед Учасниками проектів.
                            </p>

                            <p>
                                7.2. В силу цієї Угоди, Учасник проекту безумовно погоджується:

                                – з наданням своїх персональних даних як Компанії, так і Автору проекту/Спонсорові
                                та їх
                                обробкою з метою виконання цієї Угоди;
                                – з поширенням персональних даних Учасника проекту за допомогою Платформи щодо
                                інших
                                користувачів Платформи;
                                – з іншими діями Компанії щодо таких даних у зв'язку з функціонуванням
                                Платформи.
                            </p>

                            <p>
                                7.3. При внесенні Вкладу Спонсор автоматично надає Компанії згоду на публікацію
                                інформації про його
                                внесок, в тому числі прізвище, ім'я, по батькові (або назва юридичної особи), місто
                                проживання / місця знаходження Спонсора, а також надання інформації Автору проекту про
                                суму
                                внесеного ним Вкладу для отримання відповідної Винагороди за умови 100% збору коштів.
                            </p>

                            <p>
                                7.4. У разі надання Учасником проекту даних своїх контрагентів - фізичних осіб, які
                                належать
                                відповідно до законодавства України до персональних даних, Учасник проекту підтверджує
                                своє право і
                                згоду своїх контрагентів - фізичних осіб (а в разі відсутності зобов'язується
                                забезпечити отримання
                                такої згоди) на обробку та зберігання таких персональних даних, а також їх передачу
                                третім особам у
                                порядку і на умовах, передбачених цією Угодою.
                            </p>

                            <p>
                                7.5. У разі незгоди Учасника проекту із зазначеними вище умовами він повинен негайно
                                видалити свої
                                персональні дані з Платформи Компанії, так само як і припинити користування нею.
                            </p>

                            <p className="otp_big_title">
                                8. ЗАКЛЮЧНІ ПОЛОЖЕННЯ
                            </p>

                            <p>
                                8.1. Ця Угода може бути змінена Компанією в односторонньому порядку без спеціального
                                повідомлення
                                кожного з учасників і прив'язки до яких-небудь термінів.
                            </p>

                            <p>
                                8.2. Про зміну (доповнення) Угоди розміщується сповіщення на стартовій сторінці
                                Платформи.
                            </p>

                            <p>
                                8.3. Ознайомлення із змінами до Угоди є обов'язком Учасників проекту. У разі незгоди зі
                                зміною
                                Угоди Учасник проекту може розірвати його в односторонньому порядку.
                            </p>

                            <p>
                                8.4. Якщо після набрання чинності зміненої Угоди Учасник проекту продовжує користуватися
                                сервісами
                                і функціями Платформи, вважається, що він схвалив усі зміни до Угоди.
                            </p>

                            <p>
                                8.5. Визнання недійсною або нездійсненною будь-якій частині цієї Угоди не тягне
                                недійсність іншої
                                частини Угоди, яка буде залишатися в силі.
                            </p>

                            <p>
                                8.6. Компанія може в будь-який момент і без повідомлення Учасника проекту поступитися
                                своїми
                                правами на Платформу третій стороні. Автор проекту не може передати свої права та
                                обов'язки за
                                даною Угодою без попередньої згоди на це Компанії.
                            </p>

                            <p>
                                8.7. Ця Угода та відносини між Компанією та Учасником проекту регулюються законодавством
                                України.
                                Кожна сторона незаперечно погоджується з тим, що відповідні суди України мають виняткову
                                юрисдикцію
                                щодо будь-яких претензій, спорів або розбіжностей у відносинах між Сторонами.
                            </p>
                        </article>
                    </div>
                </div>

            </div>
        )
    }
};

export default Rules;