const faqData = [
    {
        q: 'Почему я должен вам доверять?',
        a: '«Пульс життя» - официально зарегистрированная в Украине негосударственная благотворительная организация. Мы создавались для осуществления благотворительной деятельности в соответствии с интересами общества и в соответствии с действующим законодательством нашей страны (Закон Украины за № 531/97-ВР). Убедиться в том, что мы работаем легально, можно в органах государственной регистрации Украины (Едином государственном реестре юридических лиц и физических лиц-предпринимателей).'
    }, {
        q: 'Кто может пожертвовать деньги?',
        a: 'Перечислить деньги на благотворительность может любой пользователь ресурса lifespulse'
    }, {
        q: 'Какую сумму можно перечислить и кому?',
        a: 'В разделе «Начать помогать» мы публикуем истории нуждающихся людей. Вы можете стать донором для любого проекта и пожертвовать любую сумму от 20 грн, используя карту любого банка через платежную систему LiqPay.'
    }, {
        q: 'Какую часть средств оставляет себе ваш фонд?',
        a: 'LifesPulse взымает 7% с каждого выведенного пожертвования. Если пользователь не получает пожертвований, то плата не взымается.'
    }, {
        q: 'Что вы можете предложить своим жертвователям (донорам) взамен?',
        a: 'Постоянным благотворителям предлагаем сотрудничество по размещению рекламы на страницах нашего сайта в виде статических, динамических банеров или текстовых блоков либо статью в нашем Блоге со словами благодарности за активное участие в благотворительности.'
    }, {
        q: 'Как узнать, что мои деньги помогли?',
        a: 'Для зарегистрированных пользователей в личном кабинете будет видна история помощи.'
    }, {
        q: 'Что такое личный кабинет?',
        a: 'Личный кабинет на LifesPulse — это закрытый от посторонних лиц раздел сайта, доступный только для зарегистрированных пользователей. Для входа в личный кабинет используется тот же адрес электронной почти, что и при регистрации. Сейчас личный кабинет позволяет видеть историю помощи и создавать собственные благотворительные истории. По мере развития ресурса мы оставляем за собой право изменять инструменты личного кабинета.'
    }, {
        q: 'Я не желаю регистрироваться, но хотел бы помочь. Это возможно?',
        a: 'Да, вы можете профинансировать любую кампанию на сайте, перейдя в раздел «Начать помогать». Кроме этого, незарегистрированный пользователь также может: оформить подписку на нашу новостную рассылку, оказать финансовую помощь нашему сервису, поделиться понравившимся проектом в своих социальных сетях.'
    }, {
        q: 'Кто может разместить заявку на сбор средств?',
        a: 'Разместись заявку на сбор пожертвований может любой человек достигший совершеннолетия. Порядок оформления предусматривает обязательно: регистрацию на сервисе, скан больничных документов и первой страницы паспорта. После оформления заявки она будет проверена модератором и опубликована.'
    }, {
        q: 'Когда я могу получить деньги, которые собрала моя заявка?',
        a: 'Вывести денежные средства можно в полном объеме или в сумме не меньше, чем 500 гривен. Вывод средств означает, что заявка выполнена и сбор денег по ней останавливается. В течение 5 рабочих дней деньги будут зачислены на указанный счет в банке.'
    }, {
        q: 'Могу ли я создать еще одну заявку?',
        a: 'Один пользователь может создать одну заявку. Если необходимо начать новый сбор средств на того же человека, что в первой заявке или на другого человека (например: родственник, друг, ребенок), то перед этим в личном кабинете к Вашей первой заявке необходимо прикрепить отчет о целевом использовании собранных и выведенных Вами средств по прошлому сбору.'
    }, {
        q: 'Могу ли я создать сбор средств не для себя а для другого человека?',
        a: 'Да, можете. Вам потребуется 2 скана паспорта: свой и реципиента. Кроме того, при создании заявки в соответствующей форме вы должны будете указать для кого создается сбор средств. Для проверки и дополнительного уточнения информации с Вами может связаться модератор.'
    }, {
        q: 'Кто имеет доступ к моим личным данным и сканам документов?',
        a: 'Все действия на LifesPulse являются безопасными. Мы гарантируем надежную защиту ваших персональных данных. Скан паспорта, больничных документов не будут доступны другим пользователям: они нужны лишь нашим модераторам для подтверждения указанной вами информации. Фото, которые вы хотите приложить для общего доступа можно добавлять в пункте "Ваша история".'
    }
];

export default faqData;